// Після святкування Дня народження Петрика Степан пішов з ним погуляти. 
// Петрик був дуже веселий – сміявся, стрибав, бігав. 
// Прогулюючись парком Степан з Петриком підійшли до сходів, що вели до атракціонів. 
// Петрик почав стрибати з однієї сходинки на іншу. 
// Причому, коли він відштовхувався не сильно, то стрибав тільки на наступну сходинку, а коли сильно – через одну.
// На яку сходинку стрибне Петрик, якщо він стоїть на сходинці з номером M, а усього сходи мають N сходинок?

// Input
// У єдиному рядку вхідного файлу записані через пробіл такі дані: число N (1 ≤ N ≤ 1000) – кількість сходинок на сходах, число M (0 ≤ M ≤ N)– номер сходинки на якій стоїть Петрик та символ, який означає силу з якою Петрик відштовхується: S (strongly) – сильно або W (weakly) – слабо.
// Output
// У вихідний файл необхідно вивести одне єдине число – номер сходинки, на якій опиниться Петрик після стрибка.

// Examples
// Input #1
// 10 3 W
// Answer #1
// 4

#include<iostream>
using namespace std;

int main()
{
    int N, M;
    char F;
    cin >> N >> M >> F;

    if (F == 'W')
    {
        M = M + 1;
    }

    else if (F == 'S')
    {
        M = M + 2;
    }

    if (M > N)
    {
        M = N;
    }

    cout << M;
}