# Автор справді хотів придумати легенду до цієї задачі, але колоквіум з матаналізу хотів автора більше.
# Вам задана коректна префікс-функція деякого рядка. Обчисліть z-функцію цього ж рядка.

# ####Вхідні данні:
# Перший рядок вхідного стандартного потоку містить число N (1 ≤ N ≤ 10^6). Наступний рядок містить N цілих невід'ємних чисел - опис префікс-функції.
# ####Вихідні данні:
# Виведіть єдиний рядок з N цілих невід'ємних чисел - опис z-функції.
n = int(input())
P = list(map(int, input().split()))
Z = [0] * n

for i in range(n):
    if P[i]:
        Z[i - P[i] + 1] = P[i]

Z[0] = 0

if Z[1]:
    for i in range(1, Z[1]):
        Z[i + 1] = Z[1] - i

for i in range(Z[1] + 1, n - 1):
    t = i
    if Z[i] and not Z[i + 1]:
        for j in range(1, Z[i]):
            if Z[i + j] <= Z[j]:
                Z[i + j] = min(Z[j], Z[i] - j)
                t = i + j
    i = t

print(" ".join(map(str, Z)))
